{
  "date": "2021-02-06T00:57:59.644Z",
  "title": "GATHS Reaffirms Commitment To It Partnership With CAG",
  "thumbnail": "/img/1116202021112-uapctgfsrm-gaths.jpg",
  "body": "The Ghana Association of Tourism and Hospitality Students (GATHS) has reaffirmed it commitment to it partnership with the Chefs Association of Ghana (CAG) on the basis of the common values and principles shared between the two – “**the values and principles of Youth Participation and Adult-Youth Partnerships in the Tourism fraternity”.**\n\nThe President of the Ghana Association of Tourism and Hospitality Students (GATHS), Mr. Isaac Frempong made this statement at the Second National Congress of the Chefs Association of Ghana (CAG) on Thursday, 12th November 2020.\n\nMr. Isaac Frempong, in his solidarity message, said the involvement of GATHS in several of CAG’s programmes offer it members the platform to have a feel of the Practical Aspect of the Hospitality programme and also expose them to the realities of the Culinary Society.\n\nHe reiterated that “the partnership between GATHS and CAG has developed over the years and covered areas such as capacity building, organizational development support, joint partnerships for grant making and project implementation, events and programmes platform sharing among others”.\n\n“This has been so, because, the leadership, members and staff of the two organizations – GATHS AND CAG, have believed in and shared common values and principles” he added.\n\nIsaac used the platform to congratulate the Chefs Association of Ghana on their success in the International Cooking Competition championship in Durban - South Africa and wished them a Happy Congress.\n\n“I also crave your indulgence to call on other Stakeholders especially those in the Tourism fraternity, to turn back and support/partner with the Students of Tourism and Hospitality in the Country in the areas of Education and Training to help develop and upgrade our human resources and also equip them with the necessary skills and Professionalism needed to upgrade the development status of our industry, even as we are getting ready to kick start post-Covid” he added.\n\n\n\n![](/img/xgltywdlc1xjb250zw50xdexmtyymdiwmjm4mtmtazvmcmk3ddjomc1nyxrocziuanbnfdc3mhwylzyvmjaymq-.jpg)\n\nThe short ceremony which was held at the Accra Tourist Information Center (ATIC) under the theme “Culinary Education, The Role Of The Chefs” featured other activities like voting in new executives of CAG and saw the presence of the Executives of Ghana Tourism Federation (GHATOF), President of the Ghana Progressive Hotels Association (GHAPROHA), President of the Tourism Society of Ghana (TOSOGHA), Miss Peace Ambassador Ghana 2020 Winner, among others.\n\nThe Ghana Association of Tourism and Hospitality Students (GATHS) is a National Association that represents and houses over 20,000 students of tourism, hospitality and their related programmes at the tertiary level.\n\nGATHS's relationship with CAG dates as far back as it early days and have had long-standing working relationships with the Chefs Association of Ghana on many of its activities."
}